#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cloudfront_lambda.local_file.config: Refreshing state... [id=be7df011281d3f53cf250fdd3617cd4e5b151a50]
aws_dynamodb_table.dynamodb-terraform-state-lock: Refreshing state... [id=example-iac-terraform-state-lock-dynamo]
aws_s3_bucket.www_bucket: Refreshing state... [id=amiblocked.io.website]
module.cloudfront_lambda.aws_iam_role.lambda: Refreshing state... [id=cloudfront_index_rewrite-us-east-1]
aws_s3_bucket.root_bucket: Refreshing state... [id=root-amiblocked.io.website]
aws_s3_bucket.terraform-state-storage-s3: Refreshing state... [id=amiblocked.io.tfstate]
aws_acm_certificate.default: Refreshing state... [id=arn:aws:acm:us-east-1:811340996907:certificate/e4bee502-483e-4de5-817a-855d40d961a7]
aws_route53_record.default: Refreshing state... [id=Z05643233JO758YN920J2__59f760da3c95b52410a88bcd125496fa.amiblocked.io._CNAME]
module.cloudfront_lambda.aws_iam_role_policy.cloudwatch: Refreshing state... [id=cloudfront_index_rewrite-us-east-1:cloudwatch]
module.cloudfront_lambda.aws_lambda_function.lambda: Refreshing state... [id=cloudfront_index_rewrite]
aws_acm_certificate_validation.default: Refreshing state... [id=2022-05-28 20:07:29.745 +0000 UTC]
aws_cloudfront_distribution.root_s3_distribution: Refreshing state... [id=E3OFEB4VR1ZF1H]
aws_cloudfront_distribution.www_s3_distribution: Refreshing state... [id=E3967CGP251YI1]
aws_route53_record.root-a: Refreshing state... [id=Z05643233JO758YN920J2_amiblocked.io_A]
aws_route53_record.www-a: Refreshing state... [id=Z05643233JO758YN920J2_www.amiblocked.io_A]
aws_s3_bucket_versioning.terraform-state-storage-s3: Refreshing state... [id=amiblocked.io.tfstate]
aws_s3_bucket_acl.www_bucket_acl: Refreshing state... [id=amiblocked.io.website,public-read]
aws_s3_bucket_website_configuration.www_bucket_website: Refreshing state... [id=amiblocked.io.website]
aws_s3_bucket_cors_configuration.www_bucket_cors: Refreshing state... [id=amiblocked.io.website]
aws_s3_bucket_acl.root_bucket_acl: Refreshing state... [id=root-amiblocked.io.website,public-read]
aws_s3_bucket_website_configuration.root_bucket_website: Refreshing state... [id=root-amiblocked.io.website]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket_cors_configuration.www_bucket_cors has been deleted
  - resource "aws_s3_bucket_cors_configuration" "www_bucket_cors" {
      - bucket = "amiblocked.io.website" -> null
      - id     = "amiblocked.io.website" -> null

      - cors_rule {
          - allowed_headers = [
              - "Authorization",
              - "Content-Length",
            ] -> null
          - allowed_methods = [
              - "GET",
              - "POST",
            ] -> null
          - allowed_origins = [
              - "https://www.amiblocked.io",
            ] -> null
          - expose_headers  = [] -> null
          - max_age_seconds = 3000 -> null
        }
    }

  # aws_s3_bucket_website_configuration.root_bucket_website has been deleted
  - resource "aws_s3_bucket_website_configuration" "root_bucket_website" {
      - bucket           = "root-amiblocked.io.website" -> null
      - id               = "root-amiblocked.io.website" -> null
      - website_domain   = "s3-website-us-east-1.amazonaws.com" -> null
      - website_endpoint = "root-amiblocked.io.website.s3-website-us-east-1.amazonaws.com" -> null

      - redirect_all_requests_to {
          - host_name = "www.amiblocked.io" -> null
        }
    }

  # aws_s3_bucket_website_configuration.www_bucket_website has been deleted
  - resource "aws_s3_bucket_website_configuration" "www_bucket_website" {
      - bucket           = "amiblocked.io.website" -> null
      - id               = "amiblocked.io.website" -> null
      - website_domain   = "s3-website-us-east-1.amazonaws.com" -> null
      - website_endpoint = "amiblocked.io.website.s3-website-us-east-1.amazonaws.com" -> null

      - error_document {
          - key = "error.html" -> null
        }

      - index_document {
          - suffix = "index.html" -> null
        }
    }

  # module.cloudfront_lambda.aws_iam_role.lambda has changed
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ Service = [
                              - "edgelambda.amazonaws.com",
                                "lambda.amazonaws.com",
                              + "edgelambda.amazonaws.com",
                            ]
                        }
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        id                    = "cloudfront_index_rewrite-us-east-1"
        name                  = "cloudfront_index_rewrite-us-east-1"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cloudfront_lambda.local_file.config has been deleted
  - resource "local_file" "config" {
      - content              = jsonencode(
            {
              - apex_domain_redirect = "true"
              - append_slash         = "false"
              - ghost_hostname       = ""
              - index_rewrite        = "true"
            }
        ) -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0777" -> null
      - filename             = "/tmp/terraform-data-dir/modules/cloudfront_lambda/lambda/config.json" -> null
      - id                   = "be7df011281d3f53cf250fdd3617cd4e5b151a50" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudfront_distribution.www_s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "www_s3_distribution" {
        id                             = "E3967CGP251YI1"
        tags                           = {
            "Project" = "amiblocked.io"
        }
        # (19 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "viewer-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:811340996907:function:cloudfront_index_rewrite:1" -> null
            }
          + lambda_function_association {
              + event_type   = "viewer-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }



        # (3 unchanged blocks hidden)
    }

  # aws_route53_record.caa will be created
  + resource "aws_route53_record" "caa" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "amiblocked.io"
      + records         = [
          + "amazon.com",
          + "amazonaws.com",
          + "amazontrust.com",
          + "awstrust.com",
        ]
      + ttl             = 86400
      + type            = "CAA"
      + zone_id         = "Z05643233JO758YN920J2"
    }

  # aws_s3_bucket_cors_configuration.www_bucket_cors will be created
  + resource "aws_s3_bucket_cors_configuration" "www_bucket_cors" {
      + bucket = "amiblocked.io.website"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "Authorization",
              + "Content-Length",
            ]
          + allowed_methods = [
              + "GET",
              + "POST",
            ]
          + allowed_origins = [
              + "https://www.amiblocked.io",
            ]
          + expose_headers  = []
          + max_age_seconds = 3000
        }
    }

  # aws_s3_bucket_website_configuration.root_bucket_website will be created
  + resource "aws_s3_bucket_website_configuration" "root_bucket_website" {
      + bucket           = "root-amiblocked.io.website"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + redirect_all_requests_to {
          + host_name = "www.amiblocked.io"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

  # aws_s3_bucket_website_configuration.www_bucket_website will be created
  + resource "aws_s3_bucket_website_configuration" "www_bucket_website" {
      + bucket           = "amiblocked.io.website"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

  # module.cloudfront_lambda.data.archive_file.lambdazip will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambdazip"  {
      ~ id                  = "b31853d6a02b953f693ab5b997f543edeec30056" -> (known after apply)
      ~ output_base64sha256 = "V0srGCo//lqd/MtHPj/cz4DQlTHLFdnnL7Ua2AntTDo=" -> (known after apply)
      ~ output_md5          = "37642cb7e7733f372a28ba58c370b099" -> (known after apply)
      ~ output_path         = "/tmp/terraform-data-dir/modules/cloudfront_lambda/lambda_function.zip" -> ".terraform/modules/cloudfront_lambda/lambda_function.zip"
      ~ output_sha          = "b31853d6a02b953f693ab5b997f543edeec30056" -> (known after apply)
      ~ output_size         = 1560 -> (known after apply)
      ~ source_dir          = "/tmp/terraform-data-dir/modules/cloudfront_lambda/lambda" -> ".terraform/modules/cloudfront_lambda/lambda"
        # (1 unchanged attribute hidden)
    }

  # module.cloudfront_lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = "/tmp/terraform-data-dir/modules/cloudfront_lambda/lambda_function.zip" -> ".terraform/modules/cloudfront_lambda/lambda_function.zip"
        id                             = "cloudfront_index_rewrite"
      ~ last_modified                  = "2022-05-31T04:54:03.294+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:811340996907:function:cloudfront_index_rewrite:1" -> (known after apply)
      ~ source_code_hash               = "V0srGCo//lqd/MtHPj/cz4DQlTHLFdnnL7Ua2AntTDo=" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cloudfront_lambda.local_file.config will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + apex_domain_redirect = "true"
              + append_slash         = "false"
              + ghost_hostname       = ""
              + index_rewrite        = "true"
            }
        )
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = ".terraform/modules/cloudfront_lambda/lambda/config.json"
      + id                   = (known after apply)
    }

Plan: 5 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @superdug, Action: `pull_request`, Working Directory: ``, Workflow: `CI`*